app/controllers/api/v1/quiz_controller.rb

INSERT INTO `quiz_users` (`assigned_by`, `assigned_to`, `created_at`, `quiz_id`, `updated_at`) VALUES (1, 2, '2014-07-30 15:52:42', 3, '2014-07-30 15:52:42')
SELECT `questions`.* FROM `questions` ORDER BY RAND() LIMIT 5
INSERT INTO `quiz_questions` (`created_at`, `question_id`, `quiz_id`, `updated_at`) VALUES ('2014-07-30 08:52:29', 3, 1, '2014-07-30 08:52:29')
SELECT `users`.* FROM `users` WHERE `users`.`role` = 'student'
---
  def create
    # — Create record in Quiz
    # — Add Questions to Quiz -> Create Record in Quiz_Questions
    # — Assign Quiz to Students -> Create Records in Quiz_Users

    @quiz = Quiz.create(created_by: current_user.id)
    @quiz.save!

    questions = Question.order("RAND()").limit(1)
    questions.each do |question|
      QuizQuestion.create(question_id: question.id, quiz_id: @quiz.id).save!
    end

    students = User.where(:role => 'student')

INSERT INTO `quiz_responses` (`created_at`, `quiz_id`, `submitted_by`, `timefinish`, `timestart`, `updated_at`) VALUES ('2014-07-30 16:05:37', 1, 2, '2014-07-30 10:38:55', '2014-07-30 10:38:55', '2014-07-30 16:05:37')
SELECT COUNT(`question_answers`.`id`) FROM `question_answers` WHERE `question_answers`.`question_id` = 3 AND `question_answers`.`answer` = 'Test'
SELECT `question_answers`.`id` FROM `question_answers` WHERE `question_answers`.`question_id` = 3 AND `question_answers`.`answer` = 'Test'
SELECT `quiz_questions`.`marks` FROM `quiz_questions` WHERE `quiz_questions`.`question_id` = 3 AND `quiz_questions`.`quiz_id` = 1
INSERT INTO `quiz_response_answers` (`answer`, `created_at`, `is_correct`, `question_id`, `quiz_response_id`, `updated_at`) VALUES ('Test', '2014-07-30 10:36:22', 0, 3, 33, '2014-07-30 10:36:22')
---
    timefinish = Time.at(timefinish_epoch).to_datetime

    total_correct = 0
    quiz_response = QuizResponse.create(quiz_id: quiz_id, timestart: timestart, timefinish: timefinish, submitted_by: current_user.id)
    answers.each do |answer|
      ques_id = answer[:question_id]
      answer = answer[:answer]
      is_correct = QuestionAnswer.where("question_id"=> ques_id, "answer" => answer).count(:id) > 0
      marks += QuizQuestion.where("question_id"=>ques_id, "quiz_id"=> quiz_id).pluck(:marks) if is_correct
      total_correct += 1 if is_correct
      QuizResponseAnswer.create(quiz_response_id: quiz_response.id, question_id: ques_id, is_correct: is_correct, answer: answer).save!